Solidification/defense/011_sol_xyHa100_1D/0/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 231030;

boundaryField
{
    upperWall
    {
        type            calculated;
        value           uniform 231030;
    }
    leftWall
    {
        type            calculated;
        value           uniform -88500;
    }
    rightWall
    {
        type            calculated;
        value           uniform 231030;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 231030;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
